# 1 - Configuração do ambiente e base de dados de desenvolvimento

* Instalação do módulo jupysql

In [1]:
INSTALL = False
if INSTALL:
    !pip install jupysql

## Carregamento da extensão *sql*

In [2]:
%load_ext sql

## Conexão à base base de dados(se não existir é criada):

In [3]:
%sql sqlite:///Exercicio_Produtos.sqlite

Connecting to 'sqlite:///Exercicio_Produtos.sqlite'

# 2 - Implementação do modelo de dados


a) Definição da tabela `produtos`


```sql
DROP TABLE IF EXISTS produtos;
```


```sql  
CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY,  
    nome TEXT ,  
    preco REAL,  
    unidades INTEGER  
);
```

No SQLite, o tipo TEXT pode armazenar até 2^31 - 1 bytes, ou seja, 2.147.483. 647 bytes (aproximadamente 2 GB) de dados.

b) Verificar se a tabela existe na base de dados  
```sql
SELECT name FROM sqlite_master WHERE type="produtos";
```

c) Popular a tabela "Produtos"(através da instrução *DML insert*)  

```sql
INSERT INTO produtos (id,nome, preco, unidades) VALUES (1,'Notebook', 3500.00, 10);  
INSERT INTO produtos (id,nome, preco, unidades) VALUES (2,'Smartphone', 2500.00, 20);  
INSERT INTO produtos (id,nome, preco, unidades) VALUES (3,'Mouse', 50.00, 100);  
INSERT INTO produtos (id,nome, preco, unidades) VALUES (4,'Teclado', 120.00, 50);
```

In [4]:
%%sql
CREATE TABLE produtos (
    numero INTEGER,
    nome text ,
    preco real,
    unidades INteger
)

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

In [5]:
%%sql
INSERT INTO produtos (numero,nome, preco, unidades) VALUES (1,'Notebook', 3500.00, 10);
INSERT INTO produtos (numero,nome, preco, unidades) VALUES (2,'Smartphone', 2500.00, 20);
INSERT INTO produtos (numero,nome, preco, unidades) VALUES (3,'Mouse', 50.00, 100);
INSERT INTO produtos (numero,nome, preco, unidades) VALUES (4,'Teclado', 120.00, 50);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

d) Efetuar uma consulta à tabela `produtos`

In [6]:
%%sql
SELECT * FROM produtos

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+--------+------------+--------+----------+
| numero |    nome    | preco  | unidades |
+--------+------------+--------+----------+
|   1    |  Notebook  | 3500.0 |    10    |
|   2    | Smartphone | 2500.0 |    20    |
|   3    |   Mouse    |  50.0  |   100    |
|   4    |  Teclado   | 120.0  |    50    |
+--------+------------+--------+----------+

e) Através de uma consulta selecionar os produtos com preço igual a 50

In [7]:
%%sql
SELECT * FROM produtos WHERE unidades > 50;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+--------+-------+-------+----------+
| numero |  nome | preco | unidades |
+--------+-------+-------+----------+
|   3    | Mouse |  50.0 |   100    |
+--------+-------+-------+----------+

f) Através de uma consulta selecionar os produtos com preço igual a 50 e com 100 unidades

In [8]:
%%sql
SELECT * FROM produtos WHERE preco = 50 AND unidades = 100;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+--------+-------+-------+----------+
| numero |  nome | preco | unidades |
+--------+-------+-------+----------+
|   3    | Mouse |  50.0 |   100    |
+--------+-------+-------+----------+

g) Eliminar a tabela "Produtos" da base de dados e recriar a tabela com as seguintes definições:     
```sql
CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY AUTOINCREMENT,  
    nome TEXT NOT NULL,  
    preco REAL NOT NULL,  
    unidades INTEGER  
);
```

In [9]:
%%sql
DROP TABLE produtos;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

In [10]:
%%sql
CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY AUTOINCREMENT,  
    nome TEXT NOT NULL,
    preco REAL NOT NULL,
    unidades INTEGER  
);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

h) Popular novamente a tabela `produtos`  
```sql
INSERT INTO produtos (nome, preco, unidades) VALUES ('Notebook', 3500.00, 10);  
INSERT INTO produtos (nome, preco, unidades) VALUES ('Smartphone', 2500.00, 20);  
INSERT INTO produtos (nome, preco, unidades) VALUES ('Mouse', 50.00, 100);  
INSERT INTO produtos (nome, preco, unidades) VALUES ('Teclado', 120.00, 50);
```

In [11]:
%%sql
INSERT INTO produtos (nome, preco, unidades) VALUES ('Notebook', 3500.00, 10);  
INSERT INTO produtos (nome, preco, unidades) VALUES ('Smartphone', 2500.00, 20);  
INSERT INTO produtos (nome, preco, unidades) VALUES ('Mouse', 50.00, 100);  
INSERT INTO produtos (nome, preco, unidades) VALUES ('Teclado', 120.00, 50);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

i) Definir a tabela "Categorias"

In [12]:
%%sql
CREATE TABLE Categorias (
    id_categoria INTEGER PRIMARY KEY AUTOINCREMENT,
    nome TEXT NOT NULL
);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

j) Popular a tabela "Categorias"

In [13]:
%%sql
INSERT INTO Categorias (nome) VALUES ('Eletrónica');
INSERT INTO Categorias (nome) VALUES ('Roupa');
INSERT INTO Categorias (nome) VALUES ('Calçado');
INSERT INTO Categorias (nome) VALUES ('Móveis');

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

k) Definir a tabela `fornecedores`  
```sql
CREATE TABLE Fornecedores (  
    id_fornecedor INTEGER PRIMARY KEY AUTOINCREMENT,  
    nome VARCHAR(50) NOT NULL,   
    endereco VARCHAR(128),  
    cidade VARCHAR(20),  
    pais   VARCHAR(30),  
    telefone VARCHAR(16),  
    email VARCHAR(30)  
);
```

In [14]:
%%sql
CREATE TABLE Fornecedores (  
    id_fornecedor INTEGER PRIMARY KEY AUTOINCREMENT,  
    nome VARCHAR(50) NOT NULL,   
    endereco VARCHAR(128),  
    cidade VARCHAR(20),  
    pais   VARCHAR(30),  
    telefone VARCHAR(16),  
    email VARCHAR(30)  
);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

l) Popular a tabela `fornecedores` 

```sql
INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Tech Solutions', 'Av. Paulista, 1000', 'São Paulo', 'Brasil', '+55 11   98765-4321', 'contato@techsolutions.com');

INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Global Supplies', '123 Main St', 'New York', 'EUA', '+1 212-555-7890',   'sales@globalsupplies.com');

INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('ElectroParts', 'Calle Mayor, 45', 'Madrid', 'Espanha', '+34 91 123   4567', 'info@electroparts.es');

INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('MegaCom', 'Rua das Flores, 500', 'Lisboa', 'Portugal', '+351 21 456   7890', 'support@megacom.pt');

INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Fast Logistics', 'Jalan Sudirman, 12', 'Jacarta', 'Indonésia', '+62 21   8765 4321', 'contact@fastlogistics.co.id');
```

In [15]:
%%sql
INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Tech Solutions', 'Av. Paulista, 1000', 'São Paulo', 'Brasil', '+55 11   98765-4321', 'contato@techsolutions.com');

INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)   
VALUES ('Global Supplies', '123 Main St', 'New York', 'EUA', '+1 212-555-7890',   'sales@globalsupplies.com');

INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)   
VALUES ('ElectroParts', 'Calle Mayor, 45', 'Madrid', 'Espanha', '+34 91 123   4567', 'info@electroparts.es');

INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)   
VALUES ('MegaCom', 'Rua das Flores, 500', 'Lisboa', 'Portugal', '+351 21 456   7890', 'support@megacom.pt');

INSERT INTO Fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Fast Logistics', 'Jalan Sudirman, 12', 'Jacarta', 'Indonésia', '+62 21   8765 4321', 'contact@fastlogistics.co.id');

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

m) Através de uma consulta selecionar os fornecedores residentes na Espanha

In [16]:
%%sql
SELECT * FROM Fornecedores WHERE pais = 'Espanha';

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+---------------+--------------+-----------------+--------+---------+-------------------+----------------------+
| id_fornecedor |     nome     |     endereco    | cidade |   pais  |      telefone     |        email         |
+---------------+--------------+-----------------+--------+---------+-------------------+----------------------+
|       3       | ElectroParts | Calle Mayor, 45 | Madrid | Espanha | +34 91 123   4567 | info@electroparts.es |
+---------------+--------------+-----------------+--------+---------+-------------------+----------------------+

n) Através de uma consulta selecionar os fornecedores residentes na Espanha e em Madrid

In [17]:
%%sql
SELECT * FROM Fornecedores WHERE pais = 'Espanha' AND cidade = 'Madrid';

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+---------------+--------------+-----------------+--------+---------+-------------------+----------------------+
| id_fornecedor |     nome     |     endereco    | cidade |   pais  |      telefone     |        email         |
+---------------+--------------+-----------------+--------+---------+-------------------+----------------------+
|       3       | ElectroParts | Calle Mayor, 45 | Madrid | Espanha | +34 91 123   4567 | info@electroparts.es |
+---------------+--------------+-----------------+--------+---------+-------------------+----------------------+

o) Redefinir a tabela `produtos`, agora com a nova coluna `id_categoria`: chave estrangeira para `categoria.id_categoria`
```sql
CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY,  
    nome TEXT , 
    preco REAL,  
    unidades INTEGER,  
    id_categoria INTEGER,  
    FOREIGN KEY (id_categoria) REFERENCES CATEGORIA(id_categoria)  
);
```

In [18]:
%%sql
DROP TABLE produtos;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

In [19]:
%%sql
CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY,  
    nome TEXT ,  
    preco REAL,  
    unidades INTEGER,  
    id_categoria INTEGER,  
    FOREIGN KEY (id_categoria) REFERENCES CATEGORIA(id_categoria)  
);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

In [20]:
%%sql
SELECT * FROM produtos;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+----+------+-------+----------+--------------+
| id | nome | preco | unidades | id_categoria |
+----+------+-------+----------+--------------+
+----+------+-------+----------+--------------+

p) Popular a tabela "PRODUTOS" de acordo com a nova estrutura

In [21]:
%%sql
SELECT * FROM Categorias;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+--------------+------------+
| id_categoria |    nome    |
+--------------+------------+
|      1       | Eletrónica |
|      2       |   Roupa    |
|      3       |  Calçado   |
|      4       |   Móveis   |
+--------------+------------+

In [ ]:
%%sql
SELECT * FROM categorias  WHERE nome = 'Eletrónica';

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+--------------+------------+
| id_categoria |    nome    |
+--------------+------------+
|      1       | Eletrónica |
+--------------+------------+

In [23]:
%%sql
INSERT INTO produtos (nome, preco, unidades, id_categoria) VALUES ('Notebook', 3500.00, 10    , 1);  
INSERT INTO produtos (nome, preco, unidades, id_categoria) VALUES ('Smartphone', 2500.00, 20  , 1);  
INSERT INTO produtos (nome, preco, unidades, id_categoria) VALUES ('Mouse', 50.00, 100        , 1);  
INSERT INTO produtos (nome, preco, unidades, id_categoria) VALUES ('Teclado', 120.00, 50      , 1);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

q) Através de uma consulta apresentar o nome do produto e nome da categoria dos produtos com mais de 100 unidades em *stock*

In [24]:
%%sql
SELECT 
    produtos.nome, categorias.nome AS categoria

FROM produtos
JOIN categorias ON produtos.id_categoria = categorias.id_categoria

WHERE produtos.unidades >= 100;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+-------+------------+
|  nome | categoria  |
+-------+------------+
| Mouse | Eletrónica |
+-------+------------+

r) Redefinir a tabela `produtos`, agora com a nova coluna `id_fornecedor`: chave estrangeira para `fornecedores.id_fornecedor`  

```sql
CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY,  
    nome TEXT ,  
    preco REAL,  
    unidades INTEGER,  
    id_categoria INTEGER,
    id_fornecedor INTEGER,  
    FOREIGN KEY (id_categoria) REFERENCES CATEGORIAS(id_categoria),  
    FOREIGN KEY (id_fornecedor) REFERENCES FORNECEDORES(id_fornecedor)    
);
```

In [25]:
%%sql
DROP TABLE produtos;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

In [26]:
%%sql
CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY,  
    nome TEXT ,  
    preco REAL,  
    unidades INTEGER,  
    id_categoria INTEGER,
    id_fornecedor INTEGER,  
    FOREIGN KEY (id_categoria) REFERENCES CATEGORIAS(id_categoria),  
    FOREIGN KEY (id_fornecedor) REFERENCES FORNECEDORES(id_fornecedor)    
);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

++
||
++
++

s) Popular a tabela `produtos` de acordo com a nova estrutura

In [27]:
%%sql
SELECT id_fornecedor, nome, pais FROM fornecedores;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+---------------+-----------------+-----------+
| id_fornecedor |       nome      |    pais   |
+---------------+-----------------+-----------+
|       1       |  Tech Solutions |   Brasil  |
|       2       | Global Supplies |    EUA    |
|       3       |   ElectroParts  |  Espanha  |
|       4       |     MegaCom     |  Portugal |
|       5       |  Fast Logistics | Indonésia |
+---------------+-----------------+-----------+

In [28]:
%%sql
SELECT id_categoria,nome FROM categorias;

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+--------------+------------+
| id_categoria |    nome    |
+--------------+------------+
|      1       | Eletrónica |
|      2       |   Roupa    |
|      3       |  Calçado   |
|      4       |   Móveis   |
+--------------+------------+

In [29]:
%%sql
INSERT INTO produtos (nome, preco, unidades, id_categoria, id_fornecedor)
VALUES ('Notebook', 3500.00, 10    , 1, 1);

INSERT INTO produtos (nome, preco, unidades, id_categoria, id_fornecedor) 
VALUES ('Smartphone', 2500.00, 20  , 1, 2);  


INSERT INTO produtos (nome, preco, unidades, id_categoria, id_fornecedor) 
VALUES ('Mouse', 50.00, 100        , 1, 3);  


INSERT INTO produtos (nome, preco, unidades, id_categoria, id_fornecedor) 
VALUES ('Teclado', 120.00, 50      , 1, 5);

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

t) Através de uma consulta apresentar o nome do produto e nome do fornecedor dos produtos em que o fornecedor reside na Indonésia

In [30]:
%%sql
SELECT
    produtos.nome AS produto,
    categorias.nome AS categoria,
    fornecedores.nome AS fornecedor,
    fornecedores.pais AS pais

FROM 
    produtos, categorias, fornecedores

WHERE 
    produtos.id_categoria = categorias.id_categoria AND
    produtos.id_fornecedor = fornecedores.id_fornecedor AND
    fornecedores.pais = 'Indonésia';

Running query in 'sqlite:///Exercicio_Produtos.sqlite'

+---------+------------+----------------+-----------+
| produto | categoria  |   fornecedor   |    pais   |
+---------+------------+----------------+-----------+
| Teclado | Eletrónica | Fast Logistics | Indonésia |
+---------+------------+----------------+-----------+

***
# end of doc